MuhsinFatih/stm32-Visual-Studio-Code-template/src/main.c
#include "main.h"
#include <stdlib.h>
#include <string.h>
#include <stdio.h>
#include "STM32F4xx.h"
#include <misc.h>
#include <stm32f4xx_rcc.h>
#include <stm32f4xx_tim.h>
#include <stm32f4xx_gpio.h>

uint8_t MPU6050_SendByte()

int PrescalerValue;

static __IO uint32_t sysTickCounter;
static __IO uint32_t microSecs;

uint32_t tick_count;
uint32_t usec_count;
uint32_t msec_count;
uint32_t sec_count;

#define onboardLEDyellow ((uint16_t) 0x1000)
#define onboardLEDorange ((uint16_t) 0x2000)
#define onboardLEDred ((uint16_t) 0x4000)
#define onboardLEDblue ((uint16_t) 0x8000)


/****************************************
 *SystemFrequency/1000      1ms         *
 *SystemFrequency/100000    10us        *
 *SystemFrequency/1000000   1us         *
 ****************************************/
void SysTick_Init(uint32_t microSeconds) {
	NVIC_InitTypeDef NVIC_InitStructure;
//	uint32_t divider = SYSTICK_FREQ / microSeconds;

	microSecs = microSeconds;
	while (SysTick_Config(SystemCoreClock / (1000000 / microSeconds)) != 0) {
	}
    
	// One SysTick interrupt now equals microSeconds

	/* set SysTick interrupt priority to high */
	NVIC_InitStructure.NVIC_IRQChannel = SysTick_IRQn;
	NVIC_InitStructure.NVIC_IRQChannelPreemptionPriority = 0;
	NVIC_InitStructure.NVIC_IRQChannelSubPriority = 0;
	NVIC_InitStructure.NVIC_IRQChannelCmd = ENABLE;
	NVIC_Init(&NVIC_InitStructure);

	NVIC_SetPriority(SysTick_IRQn, NVIC_EncodePriority(NVIC_GetPriorityGrouping(), !0, 0));
}

/**
 * This method needs to be called in the SysTick_Handler
 */
void TimeTick_Decrement(void) {
	if (sysTickCounter != 0x00){
		sysTickCounter--;
	}
}

void delay_nus(uint32_t n) {
	sysTickCounter = n / microSecs;
	while (sysTickCounter != 0) {
	}
}

void delay_1ms(void) {
	sysTickCounter = 1000 / microSecs;
	while (sysTickCounter != 0) {
	}
}

void delay_nms(uint32_t n) {
	while (n--) {
		delay_1ms();
	}
}

uint32_t delay_start_measure(void) {
	return tick_count;
}

uint32_t delay_measure(uint32_t start) {
	int32_t difference = tick_count - start;
	if (difference < 0) {
		difference = difference + INT32_MAX;
	}
	return difference * microSecs;
}

void SysTick_Handler(void) {
	TimeTick_Decrement();
	tick_count++;
	usec_count += microSecs;
	if (usec_count > 1000) {
		msec_count++;
		usec_count -= 1000;
		if (msec_count > 1000) {
			sec_count++;
			msec_count -= 1000;
		}
	}
}

void delaydelay(int asd){
	while (asd-- > 0){
		
	}
	
	
}

void TM_TIMER_Init(void) {
	TIM_TimeBaseInitTypeDef TIM_BaseStruct;
    
	/* Enable clock for TIM4 */
	RCC_APB1PeriphClockCmd(RCC_APB1Periph_TIM4, ENABLE);
	/*    
	    TIM4 is connected to APB1 bus, which has on F407 device 42MHz clock                 
	    But, timer has internal PLL, which double this frequency for timer, up to 84MHz     
	    Remember: Not each timer is connected to APB1, there are also timers connected     
	    on APB2, which works at 84MHz by default, and internal PLL increase                 
	    this to up to 168MHz                                                             
    
	    Set timer prescaller 
	    Timer count frequency is set with 
    
	    timer_tick_frequency = Timer_default_frequency / (prescaller_set + 1)        
    
	    In our case, we want a max frequency for timer, so we set prescaller to 0         
	    And our timer will have tick frequency        
    
	    timer_tick_frequency = 84000000 / (0 + 1) = 84000000 
	    */    
	TIM_BaseStruct.TIM_Prescaler = 0;
	/* Count up */
	TIM_BaseStruct.TIM_CounterMode = TIM_CounterMode_Up;
	/*
	    Set timer period when it has reset
	    First you have to know max value for timer
	    In our case it is 16bit = 65535
	    To get your frequency for PWM, equation is simple
    
	    PWM_frequency = timer_tick_frequency / (TIM_Period + 1)
    
	    If you know your PWM frequency you want to have timer period set correct
    
	    TIM_Period = timer_tick_frequency / PWM_frequency - 1
    
	    In our case, for 10Khz PWM_frequency, set Period to
    
	    TIM_Period = 84000000 / 10000 - 1 = 8399
    
	    If you get TIM_Period larger than max timer value (in our case 65535),
	    you have to choose larger prescaler and slow down timer tick frequency
	    */
	TIM_BaseStruct.TIM_Period = 8399; /* 10kHz PWM */
	TIM_BaseStruct.TIM_ClockDivision = TIM_CKD_DIV1;
	TIM_BaseStruct.TIM_RepetitionCounter = 0;
	/* Initialize TIM4 */
	TIM_TimeBaseInit(TIM4, &TIM_BaseStruct);
	/* Start count on TIM4 */
	TIM_Cmd(TIM4, ENABLE);
}


#define maxDutyCycle 8399;
TIM_OCInitTypeDef TIM_OCStruct;

void TM_PWM_Init(float pwm1, float pwm2, float pwm3, float pwm4) { //parameters' range: 0-255
    
	/* Common settings */
    
	/* PWM mode 2 = Clear on compare match */
	/* PWM mode 1 = Set on compare match */
	TIM_OCStruct.TIM_OCMode = TIM_OCMode_PWM2;
	TIM_OCStruct.TIM_OutputState = TIM_OutputState_Enable;
	TIM_OCStruct.TIM_OCPolarity = TIM_OCPolarity_Low;
    
	/*
	    To get proper duty cycle, you have simple equation
    
	    pulse_length = ((TIM_Period + 1) * DutyCycle) / 100 - 1
    
	    where DutyCycle is in percent, between 0 and 100%
    
	    25% duty cycle:     pulse_length = ((8399 + 1) * 25) / 100 - 1 = 2099
	    50% duty cycle:     pulse_length = ((8399 + 1) * 50) / 100 - 1 = 4199
	    75% duty cycle:     pulse_length = ((8399 + 1) * 75) / 100 - 1 = 6299
	    100% duty cycle:    pulse_length = ((8399 + 1) * 100) / 100 - 1 = 8399
    
	    Remember: if pulse_length is larger than TIM_Period, you will have output HIGH all the time
	    */
	TIM_OCStruct.TIM_Pulse = pwm1 / 255 * maxDutyCycle;
	TIM_OC1Init(TIM4, &TIM_OCStruct);
	TIM_OC1PreloadConfig(TIM4, TIM_OCPreload_Enable);
    
	TIM_OCStruct.TIM_Pulse = pwm2 / 255 * maxDutyCycle;
	TIM_OC2Init(TIM4, &TIM_OCStruct);
	TIM_OC2PreloadConfig(TIM4, TIM_OCPreload_Enable);
    
	TIM_OCStruct.TIM_Pulse = pwm3 / 255 * maxDutyCycle;
	TIM_OC3Init(TIM4, &TIM_OCStruct);
	TIM_OC3PreloadConfig(TIM4, TIM_OCPreload_Enable);
    
	TIM_OCStruct.TIM_Pulse = pwm4 / 255 * maxDutyCycle;
	TIM_OC4Init(TIM4, &TIM_OCStruct);
	TIM_OC4PreloadConfig(TIM4, TIM_OCPreload_Enable);
}

void setPWM(float pwm1, float pwm2, float pwm3, float pwm4) { //parameters' range: 0-255
	TIM_OCStruct.TIM_Pulse = pwm1 / 255 * maxDutyCycle;
	TIM_OC1Init(TIM4, &TIM_OCStruct);
	TIM_OC1PreloadConfig(TIM4, TIM_OCPreload_Enable);
    
	TIM_OCStruct.TIM_Pulse = pwm2 / 255 * maxDutyCycle;
	TIM_OC2Init(TIM4, &TIM_OCStruct);
	TIM_OC2PreloadConfig(TIM4, TIM_OCPreload_Enable);
    
	TIM_OCStruct.TIM_Pulse = pwm3 / 255 * maxDutyCycle;
	TIM_OC3Init(TIM4, &TIM_OCStruct);
	TIM_OC3PreloadConfig(TIM4, TIM_OCPreload_Enable);
    
	TIM_OCStruct.TIM_Pulse = pwm4 / 255 * maxDutyCycle;
	TIM_OC4Init(TIM4, &TIM_OCStruct);
	TIM_OC4PreloadConfig(TIM4, TIM_OCPreload_Enable);

}


void TM_LEDS_Init(void) {
	GPIO_InitTypeDef GPIO_InitStruct;
    
	/* Clock for GPIOD */
	RCC_AHB1PeriphClockCmd(RCC_AHB1Periph_GPIOD, ENABLE);
 
    /* Alternating functions for pins */
	GPIO_PinAFConfig(GPIOD, GPIO_PinSource12, GPIO_AF_TIM4);
	GPIO_PinAFConfig(GPIOD, GPIO_PinSource13, GPIO_AF_TIM4);
	GPIO_PinAFConfig(GPIOD, GPIO_PinSource14, GPIO_AF_TIM4);
	GPIO_PinAFConfig(GPIOD, GPIO_PinSource15, GPIO_AF_TIM4);
    
	/* Set pins */
	GPIO_InitStruct.GPIO_Pin = GPIO_Pin_12 | GPIO_Pin_13 | GPIO_Pin_14 | GPIO_Pin_15;
	GPIO_InitStruct.GPIO_OType = GPIO_OType_PP;
	GPIO_InitStruct.GPIO_PuPd = GPIO_PuPd_NOPULL;
	GPIO_InitStruct.GPIO_Mode = GPIO_Mode_AF;
	GPIO_InitStruct.GPIO_Speed = GPIO_Speed_100MHz;
	GPIO_Init(GPIOD, &GPIO_InitStruct);
}

int main(void)
{
	/* Initialize system */
	SystemInit();
	/* Init leds */
	TM_LEDS_Init();
	/* Init timer */
	TM_TIMER_Init();
	/* Init PWM */
	TM_PWM_Init(10,10,10,10);
    
	while (1) {
		for (int i = 0; i < 255; ++i)
		{
			setPWM(i, i, i, i);
			delaydelay(0x00000ffff);
		}
	}

}